In [4]:
import pandas as pd

y = [2, 4, 5]
pd.Series(y)

0    2
1    4
2    5
dtype: int64

In [6]:
x = pd.Series([3, 6, 8, 6])
x

0    3
1    6
2    8
3    6
dtype: int64

In [7]:
man = ['ned', 30, None]
pd.Series(man)

0     ned
1      30
2    None
dtype: object

In [10]:
numbers = [2, 3, 4, 5, 7, 9, None]
pd.Series(numbers)

0    2.0
1    3.0
2    4.0
3    5.0
4    7.0
5    9.0
6    NaN
dtype: float64

In [23]:
x = {'name': 'tolani',
    'surname': 'john',
    'age': '24',
    'country': 'USA',
    'email': 'tolajohn@gmail.com'}
s = pd.Series(x)
s

name                   tolani
surname                  john
age                        24
country                   USA
email      tolajohn@gmail.com
dtype: object

In [29]:
x.values

In [32]:
s = pd.Series(['melissa', 'jane', 'tom'], index =[20,22,33])
s

20    melissa
22       jane
33        tom
dtype: object

In [33]:
#QUERRY

currency = {'nigeria':  'naira',
           'america':  'dollar',
           'india':   'rupee',
           'england':  'pounds',}

s = pd.Series(currency)
s

nigeria     naira
america    dollar
india       rupee
england    pounds
dtype: object

In [34]:
s.index

Index(['nigeria', 'america', 'india', 'england'], dtype='object')

In [35]:
s.values

array(['naira', 'dollar', 'rupee', 'pounds'], dtype=object)

In [37]:
s.iloc[2]

'rupee'

In [38]:
s.iloc[0]

'naira'

In [40]:
s.iloc[3]

'pounds'

In [41]:
s.iloc[0:3]

nigeria     naira
america    dollar
india       rupee
dtype: object

In [42]:
s.iloc[1:2]

america    dollar
dtype: object

In [43]:
s.loc['nigeria']

'naira'

In [44]:
s.loc['india']

'rupee'

In [47]:
s.loc['england']

'pounds'

In [49]:
x = pd.Series([100, 300.00, 1000.08, 400.00])
x

0     100.00
1     300.00
2    1000.08
3     400.00
dtype: float64

In [50]:
import numpy as np

total = np.sum(s)
print(total)

nairadollarrupeepounds

In [51]:
total = np.sum(x)
print(total)

1800.08

In [52]:
len(x)

4

In [53]:
s.loc['india']

'rupee'

In [54]:
s.loc['rihanna'] = 'beyonce'
s

nigeria      naira
america     dollar
india        rupee
england     pounds
rihanna    beyonce
dtype: object

In [55]:
s

nigeria      naira
america     dollar
india        rupee
england     pounds
rihanna    beyonce
dtype: object

In [56]:
s.loc['ghana'] = 'cedis'
s

nigeria      naira
america     dollar
india        rupee
england     pounds
rihanna    beyonce
ghana        cedis
dtype: object

In [57]:
s

nigeria      naira
america     dollar
india        rupee
england     pounds
rihanna    beyonce
ghana        cedis
dtype: object

In [58]:
s.loc['rihanna']

'beyonce'

In [61]:
total = np.sum(s)
print(total)

nairadollarrupeepoundsbeyoncecedis

In [64]:
info_1 = {'name': 'tolani',
    'surname': 'john',
    'age': '24',
    'country': 'USA',
    'email': 'tolajohn@gmail.com'}

info_2 = {'name': 'princess',
    'surname': 'eke',
    'age': '25',
    'country': 'canada',
    'email': 'ekep@gmail.com'}

info_3 = {'name': 'nengi',
    'surname': 'hampson',
    'age': '28',
    'country': 'brazil',
    'email': 'nene@gmail.com'}

info_4 = {'name': 'ini',
    'surname': 'edo',
    'age': '32',
    'country': 'nigeria',
    'email': 'iniedo90@gmail.com'}

df = pd.DataFrame([info_1, info_2, info_3, info_4], index =['details1', 'details2', 'details3', 'details4',])
df

              name  surname age  country               email
details1    tolani     john  24      USA  tolajohn@gmail.com
details2  princess      eke  25   canada      ekep@gmail.com
details3     nengi  hampson  28   brazil      nene@gmail.com
details4       ini      edo  32  nigeria  iniedo90@gmail.com

In [65]:
df.loc['details1']

name                   tolani
surname                  john
age                        24
country                   USA
email      tolajohn@gmail.com
Name: details1, dtype: object

In [66]:
df.loc['details4']

name                      ini
surname                   edo
age                        32
country               nigeria
email      iniedo90@gmail.com
Name: details4, dtype: object

In [67]:
df.loc['details2', 'age']

'25'

In [68]:
df.loc['details3', 'name']

'nengi'

In [69]:
df.T

,details1,details2,details3,details4
name,tolani,princess,nengi,ini
surname,john,eke,hampson,edo
age,24,25,28,32
country,USA,canada,brazil,nigeria
email,tolajohn@gmail.com,ekep@gmail.com,nene@gmail.com,iniedo90@gmail.com

In [70]:
df.T

,details1,details2,details3,details4
name,tolani,princess,nengi,ini
surname,john,eke,hampson,edo
age,24,25,28,32
country,USA,canada,brazil,nigeria
email,tolajohn@gmail.com,ekep@gmail.com,nene@gmail.com,iniedo90@gmail.com

In [72]:
df.loc['details4', 'email']

'iniedo90@gmail.com'

In [73]:
df.T.loc['email']

details1    tolajohn@gmail.com
details2        ekep@gmail.com
details3        nene@gmail.com
details4    iniedo90@gmail.com
Name: email, dtype: object

In [74]:
df.T.loc['surname']

details1       john
details2        eke
details3    hampson
details4        edo
Name: surname, dtype: object

In [75]:
df.T.loc['country']

details1        USA
details2     canada
details3     brazil
details4    nigeria
Name: country, dtype: object

In [76]:
df.loc[:,['name', 'age', 'email']]

              name age               email
details1    tolani  24  tolajohn@gmail.com
details2  princess  25      ekep@gmail.com
details3     nengi  28      nene@gmail.com
details4       ini  32  iniedo90@gmail.com

In [77]:
df.drop(['details2'])

            name  surname age  country               email
details1  tolani     john  24      USA  tolajohn@gmail.com
details3   nengi  hampson  28   brazil      nene@gmail.com
details4     ini      edo  32  nigeria  iniedo90@gmail.com

In [79]:
df.drop(['surname'], axis = 1)

              name age  country               email
details1    tolani  24      USA  tolajohn@gmail.com
details2  princess  25   canada      ekep@gmail.com
details3     nengi  28   brazil      nene@gmail.com
details4       ini  32  nigeria  iniedo90@gmail.com

In [80]:
df.drop(['email'], axis = 1)

              name  surname age  country
details1    tolani     john  24      USA
details2  princess      eke  25   canada
details3     nengi  hampson  28   brazil
details4       ini      edo  32  nigeria

In [81]:
df.drop(['age'], axis = 1)

              name  surname  country               email
details1    tolani     john      USA  tolajohn@gmail.com
details2  princess      eke   canada      ekep@gmail.com
details3     nengi  hampson   brazil      nene@gmail.com
details4       ini      edo  nigeria  iniedo90@gmail.com

In [83]:
df.drop(['country'], axis = 1)

              name  surname age               email
details1    tolani     john  24  tolajohn@gmail.com
details2  princess      eke  25      ekep@gmail.com
details3     nengi  hampson  28      nene@gmail.com
details4       ini      edo  32  iniedo90@gmail.com

In [84]:
df

              name  surname age  country               email
details1    tolani     john  24      USA  tolajohn@gmail.com
details2  princess      eke  25   canada      ekep@gmail.com
details3     nengi  hampson  28   brazil      nene@gmail.com
details4       ini      edo  32  nigeria  iniedo90@gmail.com

In [86]:
surname = df['surname']
surname

details1       john
details2        eke
details3    hampson
details4        edo
Name: surname, dtype: object